In [1]:
import pandas as pd
 
# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}
 
df = pd.DataFrame(data)
 
# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [2]:
df.melt(id_vars=None, value_vars=None, var_name=None, value_name="value", col_level=None)

   variable    value
0      Name    Alice
1      Name      Bob
2      Name  Charlie
3      Math       85
4      Math       78
5      Math       92
6   Science       90
7   Science       82
8   Science       89
9   English       88
10  English       85
11  English       94

In [3]:
df

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94